app/controllers/institutions_controller.rb

    def set_institution
      @institution = Institution.find(params[:id])
---
SELECT  "institutions".* FROM "institutions" WHERE "institutions"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]