app/controllers/titles_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."translation_id" = $1  [["translation_id", 2]]
---
  def show
    @title = Title.includes([pinyin_comments: :user], :title_comments, :institutions, translations: [:user, comments: :user]).order("translations.created_at").find_by(id: params[:id])