app/controllers/titles_controller.rb

SELECT  "titles".* FROM "titles" ORDER BY "titles"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def index
    @titles = Title.includes(translations: :user).all

SELECT  "institutions".* FROM "institutions" WHERE "institutions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "titles".* FROM "titles" INNER JOIN "institutions_and_titles" ON "titles"."id" = "institutions_and_titles"."title_id" WHERE "institutions_and_titles"."institution_id" = $1  [["institution_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1
---
  def titles_by_institution
    @titles = Institution.find_by(id: params[:id]).titles.includes(translations: :user)

SELECT  "titles".* FROM "titles" WHERE "titles"."id" = $1 LIMIT $2  [["id", 101], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "translations".* FROM "translations" WHERE "translations"."title_id" = 2
---
  def show
    @title = Title.includes(translations: [:user, comments: :user]).order("translations.created_at").find_by(id: params[:id])

SELECT  "titles".* FROM "titles" WHERE "titles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_title
      @title = Title.find(params[:id])